tap "anomalyco/tap"
tap "golangci/tap"
tap "homebrew/autoupdate"
tap "oven-sh/bun"
tap "warpdl/tap"
# Run your GitHub Actions locally
brew "act"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Tool to update GitHub Actions to latest versions with SHA pinning
brew "actions-up"
# Browser automation CLI for AI agents
brew "agent-browser"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Download with resuming and segmented downloading
brew "aria2"
# Official Amazon AWS command-line interface
brew "awscli"
# Pyright fork with various improvements and built-in pylance features
brew "basedpyright"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Statistics utility to count lines of code
brew "cloc"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cross-platform make
brew "cmake"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Debugger for the Go programming language
brew "delve"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git LFS plugin that uploads and downloads using the Xet protocol
brew "git-xet"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Language server for the Go language
brew "gopls"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Client library for huggingface.co hub
brew "hf"
# Verilog simulation and synthesis tool
brew "icarus-verilog"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Next-gen compiler infrastructure
brew "llvm"
# LLVM Project Linker
brew "lld"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# NCurses Disk Usage
brew "ncdu"
# High-performance formatting tool for JavaScript and TypeScript
brew "oxfmt"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Toolkit to help you get started with Spec-Driven Development
brew "specify"
# Cross-shell prompt for astronauts
brew "starship"
# Open source Firebase alternative
brew "supabase"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# The official Warp CLI download manager
brew "warpdl/tap/warpdl"
# View, create, manipulate, print and manage files in Portable Document Format
cask "adobe-acrobat-pro"
# Image editing and design software
cask "affinity"
# Android SDK component
cask "android-platform-tools"
# Allows connection to a computer remotely
cask "anydesk"
# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Write, edit, and chat about your code with AI
cask "cursor"
# Command-line agent for Cursor
cask "cursor-cli"
cask "font-hack-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# Menu bar application that displays the CPU speed limit due to thermal issues
cask "hot"
# Free and open-source media player
cask "iina"
# Video and photo editor
cask "insta360-studio"
# JetBrains tools manager
cask "jetbrains-toolbox"
# File archiver
cask "keka"
# App to manage software development and track bugs
cask "linear-linear"
# Discover, download, and run local LLMs
cask "lm-studio"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Speech recognition tool
cask "macwhisper"
# Replacement for Docker Desktop
cask "orbstack"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "Exporter", id: 1099120373
mas "Hidden Bar", id: 1452453066
mas "HP", id: 1474276998
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Photomator", id: 1444636541
mas "PiPifier", id: 1160374471
mas "Raycast Companion", id: 6738274497
mas "SponsorBlock", id: 1573461917
mas "Telegram", id: 747648890
mas "WhatsApp", id: 310633997
mas "Wipr", id: 1662217862
mas "Xcode", id: 497799835
vscode "akamud.vscode-theme-onedark"
vscode "antfu.icons-carbon"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "eamodio.gitlens"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "ms-pyright.pyright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "oven.bun-vscode"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
go "github.com/air-verse/air"
go "golang.org/x/tools/cmd/deadcode"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/fzipp/gocyclo/cmd/gocyclo"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/securego/gosec/v2/cmd/gosec"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/gordonklaus/ineffassign"
go "go.uber.org/mock/mockgen"
go "github.com/oapi-codegen/oapi-codegen/v2/cmd/oapi-codegen"
go "honnef.co/go/tools/cmd/staticcheck"
uv "harbor"
